rotor_orig/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
default		cellMDLimited Gauss linear 0.5;
/*default		Gauss linear;*/
}

divSchemes
{
	div(phi,U) 			bounded Gauss linearUpwind grad(U);
/*	div(phi,omega) 			bounded Gauss linearUpwind grad(U);*/
	div(phi,omega) 			bounded Gauss upwind;
/*	div(phi,k) 			bounded Gauss linearUpwind grad(U);*/
	div(phi,k) 			bounded Gauss upwind;
/*	div(phi,epsilon) 		bounded Gauss upwind;*/
/*	div(phi,R)      		bounded Gauss linearUpwind;*/
/*	div(R)          		bounded Gauss linearUpwind;*/
/*	div(phi,nuTilda) 		bounded Gauss linearUpwind;*/
	div((nuEff*dev(T(grad(U))))) 	Gauss linear;
	div((nuEff*dev2(T(grad(U)))))	Gauss linear;
}

laplacianSchemes
{
	default		Gauss linear limited 0.5;
	laplacian(1,p)  Gauss linear corrected; // potential
}

interpolationSchemes
{
    default         linear;
    interpolate(U) linear;
}

snGradSchemes
{
    default         limited 0.5;
}

fluxRequired
{
    default         no;
    p               ;
    Phi;
}

wallDist
{
    method meshWave;
}

// ************************************************************************* //
