rotor_orig/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(

{
	name blade1Set;
	type cellSet;
	action new;
	source cylinderToCell;
	sourceInfo
	{
		p1 (-500 0 0); // start point on cylinder axis
		p2 (1000 0 0); // end point on cylinder axis
		radius 500;
	}
}

{
	name blade1Zone;
	type cellZoneSet;
	action new;
	source setToCellZone;
	sourceInfo
	{
		set blade1Set;
	}
}

);

// ************************************************************************* //


// ************************************************************************* //
